Repository: mikspec/fuelcalc
Catalog: lib/l10n/app_*.arb
Languages: pl

# appTitle
source: Fuel Calculator
pl: Kalkulator Paliwa

# homeTitle
source: Fuel Calculator
pl: Kalkulator Paliwa

source: Vehicles
pl: Pojazdy

source: Add Vehicle
pl: Dodaj Pojazd

source: Language
pl: Język

source: Delete Vehicle
pl: Usuń pojazd

# deleteVehicleConfirm
source: Are you sure you want to delete vehicle "{vehicleName}"? All refuels and expenses will be permanently deleted.
pl: Czy na pewno chcesz usunąć pojazd "{vehicleName}"? Wszystkie tankowania i wydatki zostaną trwale usunięte.

source: Cancel
pl: Anuluj

source: Delete
pl: Usuń

# vehicleDeleted
source: Vehicle has been deleted
pl: Pojazd został usunięty

# errorDeleteVehicle
source: Error deleting vehicle: {error}
pl: Błąd usuwania pojazdu: {error}

# errorLoadingVehicles
source: Error loading vehicles: {error}
pl: Błąd ładowania pojazdów: {error}

source: View Details
pl: Zobacz Szczegóły

source: Edit
pl: Edytuj

# noVehicles
source: No vehicles added yet. Tap the + button to add your first vehicle.
pl: Nie dodano jeszcze żadnych pojazdów. Dotknij przycisk + aby dodać pierwszy pojazd.

source: Refuels
pl: Tankowania

source: Statistics
pl: Statystyki

source: Add refuel
pl: Dodaj tankowanie

source: Refuel Form
pl: Formularz Tankowania

source: Edit Refuel
pl: Edytuj Tankowanie

source: Amount
pl: Ilość

source: Cost
pl: Koszt

source: Date
pl: Data

source: Time
pl: Godzina

source: Odometer
pl: Przebieg

source: Fuel Type
pl: Typ Paliwa

source: Gasoline
pl: Benzyna

source: Refuel Type
pl: Typ tankowania

source: Full Tank
pl: Pełny bak

source: Partial
pl: Częściowe

source: Station Rating
pl: Ocena stacji

source: Location
pl: Lokalizacja

# getLocation
source: Get
pl: Pobierz

source: Notes
pl: Notatki

source: Save
pl: Zapisz

# errorSaving
source: Error saving: {error}
pl: Błąd zapisu: {error}

source: Please enter amount
pl: Proszę wprowadzić ilość

source: Please enter cost
pl: Proszę wprowadzić koszt

# pleaseEnterOdometer
source: Please enter odometer reading
pl: Proszę wprowadzić przebieg

# statisticsTitle
source: Statistics - {vehicleName}
pl: Statystyki - {vehicleName}

source: Data Range
pl: Zakres danych

source: Last 5
pl: Ostatnie 5

source: Last 10
pl: Ostatnie 10

source: All
pl: Wszystkie

source: Summary
pl: Podsumowanie

source: Fuel:
pl: Paliwo:

source: Expenses:
pl: Wydatki:

source: Total:
pl: Razem:

source: Cost per 100 km
pl: Koszt na 100 km

source: Refuel Chart
pl: Wykres Tankowań

source: Consumption Chart
pl: Wykres Spalania

source: No data to display
pl: Brak danych do wyświetlenia

source: No consumption data
pl: Brak danych o spalaniu

# errorLoadingStatistics
source: Error loading statistics: {error}
pl: Błąd ładowania statystyk: {error}

source: Export Backup
pl: Eksportuj Backup

source: Import Backup
pl: Importuj Backup

source: Export SQLite
pl: Eksportuj SQLite

source: Import SQLite
pl: Importuj SQLite

# backupDownloaded
source: Backup has been downloaded
pl: Backup został pobrany

source: Data imported successfully
pl: Dane zostały zaimportowane pomyślnie

source: Confirm Import
pl: Potwierdź import

# importWarning
source: Importing backup data may overwrite existing data. Do you want to continue?
pl: Import danych z backup może nadpisać istniejące dane. Czy chcesz kontynuować?

source: Import
pl: Importuj

# errorExport
source: Export error: {error}
pl: Błąd eksportu: {error}

# errorImport
source: Import error: {error}
pl: Błąd importu: {error}

source: Vehicle Name
pl: Nazwa Pojazdu

source: Vehicle Alias
pl: Alias Pojazdu

source: Please enter vehicle name
pl: Proszę wprowadzić nazwę pojazdu

# addVehicleTitle
source: Add Vehicle
pl: Dodaj Pojazd

# editVehicleTitle
source: Edit Vehicle
pl: Edytuj Pojazd

source: Rating:
pl: Ocena:

source: Delete Refuel
pl: Usuń tankowanie

# deleteRefuelConfirm
source: Are you sure you want to delete refuel from {date}?
pl: Czy na pewno chcesz usunąć tankowanie z {date}?

# refuelDeleted
source: Refuel has been deleted
pl: Tankowanie zostało usunięte

# errorDeleteRefuel
source: Error deleting refuel: {error}
pl: Błąd usuwania tankowania: {error}

# refuelsTitle
source: Refuels - {vehicleName}
pl: Tankowania - {vehicleName}

# errorLoadingRefuels
source: Error loading refuels: {error}
pl: Błąd ładowania tankowań: {error}

# errorLoadingData
source: Error loading data: {error}
pl: Błąd ładowania danych: {error}

source: Recent Refuels
pl: Ostatnie tankowania

source: View All
pl: Zobacz wszystkie

source: No refuels
pl: Brak tankowań

source: Recent Expenses
pl: Ostatnie wydatki

source: No Expenses
pl: Brak wydatków

# quickStats
source: Quick Statistics
pl: Szybkie statystyki

source: Total refuels
pl: Łączna liczba tankowań

source: Average consumption
pl: Średnie spalanie

source: Total distance
pl: Całkowity dystans

source: Last refuel
pl: Ostatnie tankowanie

source: Description
pl: Opis

# initialMileage
source: Initial mileage (km)
pl: Początkowy przebieg (km)

# tankCapacity
source: Tank capacity (l)
pl: Pojemność baku (l)

source: Refuel added
pl: Tankowanie dodane

source: Refuel updated
pl: Tankowanie zaktualizowane

source: Backup Management
pl: Zarządzanie Backup

source: Export Data
pl: Eksport danych

source: Import Data
pl: Import danych

# exportDataDescription
source: Create a backup of all application data (cars, refuels, expenses).
pl: Utwórz kopię zapasową wszystkich danych aplikacji (samochody, tankowania, wydatki).

# importDataDescription
source: Load data from backup file. Warning: this may overwrite existing data.
pl: Wczytaj dane z pliku backup. Uwaga: może to nadpisać istniejące dane.

# exportDataButton
source: Export Data
pl: Eksportuj dane

# importDataButton
source: Import Data
pl: Importuj dane

source: Export SQLite Database
pl: Eksport bazy SQLite

source: Import SQLite Database
pl: Import bazy SQLite

# exportSqliteDescription
source: Export the original SQLite database file. Can be opened in other SQLite applications.
pl: Eksportuj oryginalny plik bazy danych SQLite. Można go otworzyć w innych aplikacjach SQLite.

# importSqliteDescription
source: Load SQLite database file. WARNING: this will replace the entire existing database!
pl: Wczytaj plik bazy SQLite. UWAGA: zastąpi to całą istniejącą bazę danych!

# exportSqliteButton
source: Export SQLite
pl: Eksportuj SQLite

# importSqliteButton
source: Import SQLite
pl: Importuj SQLite

source: Information
pl: Informacje

# backupInformation
source: • JSON Backup: universal format, works on all platforms • SQLite Backup: original database file, desktop/mobile only • Both formats contain all data • SQLite can be opened in external tools • Import may overwrite existing data
pl: • Backup JSON: uniwersalny format, działa na wszystkich platformach • Backup SQLite: oryginalny plik bazy, tylko na desktop/mobile • Oba formaty zawierają wszystkie dane • SQLite można otworzyć w zewnętrznych narzędziach • Import może nadpisać istniejące dane

# sqliteExportNotAvailableOnWeb
source: SQLite export is not available on web
pl: Eksport SQLite nie jest dostępny na web

# sqliteImportNotAvailableOnWeb
source: SQLite import is not available on web
pl: Import SQLite nie jest dostępny na web

source: SQLite database exported
pl: Baza SQLite została wyeksportowana

source: SQLite database imported successfully
pl: Baza SQLite została zaimportowana pomyślnie

# confirmImportMessage
source: Importing data from backup may overwrite existing data. Do you want to continue?
pl: Import danych z backup może nadpisać istniejące dane. Czy chcesz kontynuować?

source: Confirm SQLite Import
pl: Potwierdź import SQLite

# confirmSqliteImportMessage
source: Importing SQLite file will replace the entire existing database. This operation cannot be undone. Do you want to continue?
pl: Import pliku SQLite zastąpi całą istniejącą bazę danych. Ta operacja nie może być cofnięta. Czy chcesz kontynuować?

source: REPLACE DATABASE
pl: ZASTĄP BAZĘ

# automaticDownloadFailed
source: Automatic download failed. Copy the data below:
pl: Automatyczne pobieranie nie powiodło się. Skopiuj dane poniżej:

source: Close
pl: Zamknij

# fileDownloadInDevelopment
source: File download on this platform is in development
pl: Pobieranie plików na tej platformie w rozwoju

# exportInDevelopment
source: Export on mobile - feature in development
pl: Eksport na mobile - funkcja w rozwoju

source: Expense added
pl: Wydatek dodany

source: Expense updated
pl: Wydatek zaktualizowany

source: Add expense
pl: Dodaj wydatek

source: Edit Expense
pl: Edytuj wydatek

source: Basic Data
pl: Podstawowe dane

# titleRequired
source: Title is required
pl: Tytuł jest wymagany

source: Required
pl: Wymagane

source: Invalid cost
pl: Nieprawidłowy koszt

source: Category
pl: Kategoria

source: Date and Details
pl: Data i szczegóły

source: Service Rating
pl: Ocena usługi

source: Update Expense
pl: Zaktualizuj wydatek

source: Delete Expense
pl: Usuń wydatek

# confirmDeleteExpense
source: Are you sure you want to delete expense "{title}"?
pl: Czy na pewno chcesz usunąć wydatek \"{title}\"?

source: Expense deleted
pl: Wydatek został usunięty

# addFirstExpense
source: Add your first expense using the button below
pl: Dodaj pierwszy wydatek używając przycisku poniżej

source: Total cost
pl: Całkowity koszt

source: Number of expenses
pl: Liczba wydatków

# addExpenseTooltip
source: Add Expense
pl: Dodaj wydatek

source: Title
pl: Tytuł

source: Vehicle added
pl: Pojazd dodany

source: Vehicle updated
pl: Pojazd zaktualizowany

source: Basic Information
pl: Podstawowe informacje

source: Technical Parameters
pl: Parametry techniczne

source: Enter valid mileage
pl: Wprowadź prawidłowy przebieg

source: Enter valid capacity
pl: Wprowadź prawidłową pojemność

source: Update Vehicle
pl: Zaktualizuj pojazd

# addVehicleButton
source: Add Vehicle
pl: Dodaj pojazd

# exportError
source: Export error: {error}
pl: Błąd eksportu: {error}

# importError
source: Import error: {error}
pl: Błąd importu: {error}

# invalidBackupFormat
source: Invalid backup file format. Check if the file contains a valid JSON object with version, timestamp and cars fields.
pl: Nieprawidłowy format pliku backup. Sprawdź czy plik zawiera prawidłowy obiekt JSON z polami version, timestamp i cars.

# sqliteExportError
source: SQLite export error: {error}
pl: Błąd eksportu SQLite: {error}

# sqliteImportError
source: SQLite import error: {error}
pl: Błąd importu SQLite: {error}

# invalidSqliteFormat
source: Invalid SQLite file format
pl: Nieprawidłowy format pliku SQLite

# fileDownloaded
source: File {fileName} has been downloaded
pl: Plik {fileName} został pobrany

# lastRefuels
source: Last 10 refuels
pl: Ostatnie 10 tankowań

# avgConsumption
source: Average consumption
pl: Średnie spalanie

# avgPrice
source: Average price
pl: Średnia cena

source: Distance
pl: Dystans

source: Fuel costs
pl: Koszty paliwa

# saveError
source: Save error: {error}
pl: Błąd zapisu: {error}

# titleHint
source: e.g. Oil change
pl: np. Wymiana oleju

# descriptionLabel
source: Description/Notes
pl: Opis/Notatki

# descriptionHint
source: Additional information about the expense...
pl: Dodatkowe informacje o wydatku...

# expenseTypeOther
source: Other
pl: Inne

# expenseTypeRepair
source: Repair
pl: Naprawa

# expenseTypeTowing
source: Towing
pl: Laweta

# expenseTypeInsurance
source: Insurance
pl: Ubezpieczenie

# expenseTypeInspection
source: Inspection
pl: Przegląd

# expenseTypeUnknown
source: Unknown
pl: Nieznane

source: Refuel Statistics
pl: Statystyki tankowań

source: Expense Statistics
pl: Statystyki wydatków

source: Number of refuels
pl: Liczba tankowań

source: Total fuel amount
pl: Całkowita ilość paliwa

source: Average price per liter
pl: Średnia cena za litr

source: Average cost
pl: Średni koszt

source: Invalid volume
pl: Nieprawidłowa ilość

source: Invalid odometer reading
pl: Nieprawidłowy stan

# errorLoadingLastOdometer
source: Error loading last odometer reading: {error}
pl: Błąd ładowania ostatniego odczytu licznika: {error}

# errorLoadingLocation
source: Error loading location: {error}
pl: Błąd pobierania lokalizacji: {error}

# errorCalculatingDistance
source: Error calculating distance: {error}
pl: Błąd obliczania dystansu: {error}

source: Distance from last
pl: Dystans od ostatniego

# lastOdometer
source: Last: {reading} km
pl: Ostatni: {reading} km

# additionalInfoHint
source: Additional information...
pl: Dodatkowe informacje...

source: Loading location...
pl: Pobieranie lokalizacji...

# locationCoordinates
source: Location: {latitude}, {longitude}
pl: Lokalizacja: {latitude}, {longitude}

source: Location unavailable
pl: Lokalizacja niedostępna

source: Update Refuel
pl: Zaktualizuj tankowanie

# addRefuelButton
source: Add Refuel
pl: Dodaj tankowanie

# errorLoadingExpenses
source: Error loading expenses: {error}
pl: Błąd ładowania wydatków: {error}

# errorDeletingExpense
source: Error deleting expense: {error}
pl: Błąd usuwania wydatku: {error}

# dateLabel
source: Date:
pl: Data:

# ratingLabel
source: Rating:
pl: Ocena:

source: No description
pl: Brak opisu

source: No refuels yet
pl: Brak tankowań

# addFirstRefuel
source: Add your first refuel using the button below
pl: Dodaj pierwsze tankowanie używając przycisku poniżej

source: Price per liter
pl: Cena za litr

source: Consumption
pl: Spalanie

source: Odometer reading
pl: Stan licznika

source: GPS Location
pl: Lokalizacja GPS

# addRefuelTooltip
source: Add refuel
pl: Dodaj tankowanie
